In [1]:
import pandas as pd

## EmploymentExperience
- EmployeeID (FK)
- YearsAtCompany
- YearsSinceLastPromotion
- YearsInCurrentRole
- YearsWithCurrentManager

## CompanyStandards
- Salary 
- AverageSalary // Propuesta de nueva columna para hacer la media de ingresos de los empleados
- StandardHours

In [4]:
data = pd.read_csv("../files/HR_RAW_DATA.csv")

In [27]:
data.columns

Index(['Unnamed: 0', 'Age', 'Attrition', 'BusinessTravel', 'DailyRate',
       'Department', 'DistanceFromHome', 'Education', 'EducationField',
       'employeecount', 'employeenumber', 'EnvironmentSatisfaction', 'Gender',
       'HourlyRate', 'JobInvolvement', 'JobLevel', 'JobRole',
       'JobSatisfaction', 'MaritalStatus', 'MonthlyIncome', 'MonthlyRate',
       'NUMCOMPANIESWORKED', 'Over18', 'OverTime', 'PercentSalaryHike',
       'PerformanceRating', 'RelationshipSatisfaction', 'StandardHours',
       'StockOptionLevel', 'TOTALWORKINGYEARS', 'TrainingTimesLastYear',
       'WORKLIFEBALANCE', 'YearsAtCompany', 'YearsInCurrentRole',
       'YearsSinceLastPromotion', 'YEARSWITHCURRMANAGER',
       'SameAsMonthlyIncome', 'DateBirth', 'Salary', 'RoleDepartament',
       'NUMBERCHILDREN', 'RemoteWork'],
      dtype='object')

In [5]:
data.head(5)

,Unnamed: 0,Age,Attrition,BusinessTravel,DailyRate,Department,DistanceFromHome,Education,EducationField,employeecount,...,YearsAtCompany,YearsInCurrentRole,YearsSinceLastPromotion,YEARSWITHCURRMANAGER,SameAsMonthlyIncome,DateBirth,Salary,RoleDepartament,NUMBERCHILDREN,RemoteWork
0,0,51,No,NaN,"684,0$",NaN,6,3,NaN,1,...,20,NaN,15,15,"19537,0",1972,1000000000$,NaN,NaN,Yes
1,1,52,No,NaN,"699,0$",NaN,1,4,Life Sciences,1,...,33,NaN,11,9,"19999,0",1971,1000000000$,NaN,NaN,1
2,2,42,No,travel_rarely,"532,0$",Research & Development,4,2,Technical Degree,1,...,22,NaN,11,15,"19232,0",1981,1000000000$,ManaGER - Research & Development,NaN,1
3,3,47,No,travel_rarely,"359,0$",NaN,2,4,Medical,1,...,20,NaN,5,6,"17169,0",1976,1000000000$,NaN,NaN,False
4,4,46,No,NaN,"1319,0$",NaN,3,3,Technical Degree,1,...,19,NaN,2,8,NaN,1977,1000000000$,NaN,NaN,0

# columna de employee number

In [29]:
#numero de nulo en la columna de employee number
data.employeenumber.isnull().sum()

431

In [30]:
#numero de duplicados en la columna de employee number 
data.employeenumber.duplicated().sum()

534

# columna de Years at company

In [17]:
##numero de nulo en la columna years at company
data.YearsAtCompany.isnull().sum()

0

In [31]:
data.YearsAtCompany.duplicated().sum()

1577

In [41]:
data.YearsAtCompany.unique()

array([20, 33, 22, 19, 21, 18, 24, 31, 26, 16, 23, 15, 17, 32, 14, 13, 25,
       12, 11, 37, 40, 36, 27, 29, 10,  9, 30,  8,  7, 34,  6,  5,  4,  2,
        3,  1,  0])

# columna de years since last promotion

In [16]:
data.YearsSinceLastPromotion.isnull().sum()

0

In [32]:
data.YearsSinceLastPromotion.duplicated().sum()

1598

In [43]:
data.duplicated(subset= "YearsSinceLastPromotion").sum()

1598

In [42]:
data.YearsSinceLastPromotion.unique()

array([15, 11,  5,  2,  4,  7,  0,  1, 13, 14,  8, 12,  3,  6, 10,  9])

# columna Years in current role

In [14]:
data.YearsInCurrentRole.isnull().sum()

1580

In [33]:
data.YearsInCurrentRole.duplicated().sum()

1603

In [54]:
# los valores encontrados estan como string paasar a float 

data.YearsInCurrentRole.unique()

array([nan, '13,0', '12,0', '11,0', '7,0', '6,0', '4,0', '3,0', '2,0',
       '1,0', '0,0'], dtype=object)

# columna years with current manager

In [24]:
data.YEARSWITHCURRMANAGER.isnull().sum()

0

In [34]:
data.YEARSWITHCURRMANAGER.duplicated().sum()

1596

In [ ]:
data.YEARSWITHCURRMANAGER.

## CompanyStandards
- Salary 
- AverageSalary // Propuesta de nueva columna para hacer la media de ingresos de los empleados
- StandardHours

# columna salary

In [37]:
data.Salary

0       1000000000$
1       1000000000$
2       1000000000$
3       1000000000$
4       1000000000$
           ...
1609    1000000000$
1610    1000000000$
1611    1000000000$
1612    1000000000$
1613    1000000000$
Name: Salary, Length: 1614, dtype: object

# columna de standar hours

In [38]:
data.StandardHours

0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
       ...
1609    NaN
1610    NaN
1611    NaN
1612    NaN
1613    NaN
Name: StandardHours, Length: 1614, dtype: object

In [39]:
data.StandardHours.isnull().sum()

1195

In [40]:
data.StandardHours.duplicated().sum()

1612

In [51]:
data.isna().sum()/data.shape[0]*100

Unnamed: 0                    0.000000
Age                           0.000000
Attrition                     0.000000
BusinessTravel               47.831475
DailyRate                     0.000000
Department                   81.288724
DistanceFromHome              0.000000
Education                     0.000000
EducationField               46.158612
employeecount                 0.000000
employeenumber               26.703841
EnvironmentSatisfaction       0.000000
Gender                        0.000000
HourlyRate                    0.000000
JobInvolvement                0.000000
JobLevel                      0.000000
JobRole                       0.000000
JobSatisfaction               0.000000
MaritalStatus                40.334572
MonthlyIncome                52.230483
MonthlyRate                   0.000000
NUMCOMPANIESWORKED            0.000000
Over18                       55.824040
OverTime                     41.883519
PercentSalaryHike             0.000000
PerformanceRating            12.081784
RelationshipSatisfaction      0.000000
StandardHours                74.039653
StockOptionLevel              0.000000
TOTALWORKINGYEARS            32.589839
TrainingTimesLastYear         0.000000
WORKLIFEBALANCE               6.691450
YearsAtCompany                0.000000
YearsInCurrentRole           97.893432
YearsSinceLastPromotion       0.000000
YEARSWITHCURRMANAGER          0.000000
SameAsMonthlyIncome          52.230483
DateBirth                     0.000000
Salary                        0.000000
RoleDepartament              81.288724
NUMBERCHILDREN              100.000000
RemoteWork                    0.000000
dtype: float64